runs/cylinder3dre3900/smagorinsky/fine/RANS/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -1 0 0 0 0];

internalField uniform 1e-10;

boundaryField
{
    snake
    {
        type nutLowReWallFunction;
        value $internalField;
    }

    inlet
    {
        type zeroGradient;
    }

    outlet
    {
        type zeroGradient;
    }

    bottom
    {
        type symmetryPlane;
    }

    top
    {
        type symmetryPlane;
    }

    front
    {
        type cyclic;
    }

    back
    {
        type cyclic;
    }
}

//****************************************************************************//
